In [1]:
import pandas as pd
import numpy as np

In [2]:
n_rows = 5
n_cols = 5
cols = tuple('ABCDE')

df = pd.DataFrame(np.random.randint(1, 10, size=(n_rows, n_cols)), columns=cols)
df

   A  B  C  D  E
0  7  6  7  7  2
1  2  8  6  8  5
2  9  9  7  8  6
3  8  3  6  6  7
4  5  7  7  9  5

# Rename Kolom

In [7]:
df.rename(columns={'C':'nama', 'A': 'id', 'B': 'identity_id'})

   id  identity_id  nama  D  E
0   7            6     7  7  2
1   2            8     6  8  5
2   9            9     7  8  6
3   8            3     6  6  7
4   5            7     7  9  5

In [9]:
df = pd.util.testing.makeMissingDataframe().reset_index()
df.head()

        index         A         B         C         D
0  0AgfEptYi7 -0.132978  0.173809  0.632424 -1.698659
1  qCTItuzpqW -0.054844       NaN  0.425933 -1.345535
2  MFiY4DXk74       NaN -1.067007 -1.068571 -1.598773
3  W3fgQLnJRB -0.757019 -0.445969  0.017028 -0.612444
4  erZMLWmIhH  2.084988  0.361879  0.211901 -0.515604

In [12]:
df = df.rename(columns={'index':'Z'})
df.head()

            Z         A         B         C         D
0  0AgfEptYi7 -0.132978  0.173809  0.632424 -1.698659
1  qCTItuzpqW -0.054844       NaN  0.425933 -1.345535
2  MFiY4DXk74       NaN -1.067007 -1.068571 -1.598773
3  W3fgQLnJRB -0.757019 -0.445969  0.017028 -0.612444
4  erZMLWmIhH  2.084988  0.361879  0.211901 -0.515604

# Membuat backup data frame

In [16]:
df_backup = df.copy(deep=True)
df_backup.shape

(18, 5)

# Drop columns with NaN values

In [18]:
df = df.dropna(axis='columns')
df.head()

            Z         A         B         C         D
0  0AgfEptYi7 -0.132978  0.173809  0.632424 -1.698659
3  W3fgQLnJRB -0.757019 -0.445969  0.017028 -0.612444
4  erZMLWmIhH  2.084988  0.361879  0.211901 -0.515604
5  pCHZ2sCatY -0.233393 -0.342611 -0.629503 -2.800863
6  ANysvDUBHv -1.345998 -1.276629  0.899578 -0.582978

# Drop rows with NaN values

In [19]:
df = df_backup.copy(deep=True) #Balikin lagi df ke semula
df = df.dropna(axis='rows')
df.head()

            Z         A         B         C         D
0  0AgfEptYi7 -0.132978  0.173809  0.632424 -1.698659
3  W3fgQLnJRB -0.757019 -0.445969  0.017028 -0.612444
4  erZMLWmIhH  2.084988  0.361879  0.211901 -0.515604
5  pCHZ2sCatY -0.233393 -0.342611 -0.629503 -2.800863
6  ANysvDUBHv -1.345998 -1.276629  0.899578 -0.582978

# Persentase missing value (every columns)

In [20]:
df = df_backup.copy(deep=True)
df.isna().mean()

Z    0.0
A    0.0
B    0.0
C    0.0
D    0.0
dtype: float64

# Drop kolom berdasarkan threshold (kondisi)

In [25]:
treshold = len(df) * 0.9 #kondisi nya
df = df.dropna(thresh=treshold, axis='columns')

In [27]:
data = {
    'A': [10, 10, 13, np.nan, 13],
    'B': [10, 10, 13, np.nan, 13]
}
df_2 = pd.DataFrame(data)
df_2

      A     B
0  10.0  10.0
1  10.0  10.0
2  13.0  13.0
3   NaN   NaN
4  13.0  13.0

# Periksa kesamaan antar kolom (duplicate)

In [33]:
df_2['A'].equals(df_2['B'])

True

 # Membagi dataframe menjadi 2 (dgn acak & kondisi)

In [36]:
n_rows = 10
n_cols = 5
cols = tuple('ABCDE')

df3 = pd.DataFrame(np.random.randint(1, 20, size=(n_rows, n_cols)), columns=cols)
df3.shape

(10, 5)

In [37]:
proporsi = 0.7
df3_1 = df3.sample(frac=proporsi)
df3_2 = df3.drop(df3_1.index)

print(f'df3_1: {df3_1.shape}')
print(f'df3_2: {df3_2.shape}')

df3_1: (7, 5)
df3_2: (3, 5)

In [38]:
df3_1

    A   B   C   D   E
9   1  11  16  15   2
2  15   8  19   2   4
4  19   4   4   7  18
6   9   7   7  15  12
8   9   9  15  16   4
3  19   3  16  15  13
5  17  12  13   5   3

In [39]:
df3_2

   A   B   C   D   E
0  3  18   1  10  18
1  7  11  12  18  13
7  9   1   1  15  18